<template>
    <div>
        <div class="card">
        <div class="card-header pd-t-20 d-sm-flex align-items-start justify-content-between bd-b-0 pd-b-0">
            <div>
                <h4 class="mg-b-5 ">Политика конфеденциальностие</h4>
            </div>
        </div>
        <div class="card-body pd-20 bd-b pd-b-20">
            <div class="row">
                <div class="col-12">
                    <div class=" card-crypto">
                    <div class="">
                        <div class="">
                            <div>
  <div class="rules rules-terms">
      <h1>Политика конфиденциальности</h1>

      <div class="rules-container">
        <p>Пожалуйста, внимательно прочитайте эту Политику конфиденциальности перед использованием https://{{this.link}}.</p>
        <p>Мы предоставляем доступ к различным играм на нашей платформе. Пользуясь нашими сервисами, Вы доверяете нам свою информацию. Мы понимаем, что это большая ответственность, и прилагаем все усилия, чтобы защитить Ваши данные и дать Вам возможность управлять ими.</p>
        <p>В этой Политике конфиденциальности описано, какую информацию мы собираем, с какой целью мы это делаем и как Вы можете обновлять, удалять свои данные и управлять ими.</p>

        <h2>Информация, которую мы собираем</h2>

        <p>Виды персональной информации, которую мы собираем:</p>

        <ul>
          <li>имя, игровой никнейм;</li>
          <li>адрес электронной почты;</li>
          <li>номер телефона;</li>
          <li>IP-адрес, браузер, ОС;</li>
          <li>номера кошельков, из которых были пополнения и выводы;</li>
          <li>если Вы создаете аккаунт через социальные сети (ВКонтакте, Telegram), то, соответственно, мы будем хранить Ваше имя, фотографию профиля, ссылку на страницу в социальные сети.</li>
        </ul>

        <h2>Как мы используем информацию, полученную от игроков</h2>

        <p>Став игроком, или иным способом предоставив WINMONEY персональную информацию, Вы соглашаетесь с тем, что мы собираем и используем Вашу персональную информацию для предоставления нами услуг.</p>
        <p>Вы соглашаетесь на предоставления номера телефона и/или адреса электронной почты третьей стороне для маркетинговых целей.</p>
        <p>Вы соглашаетесь на предоставление ID игры, имени Вашего игрока, ставки, выигрышного коэффициента и выигрыша для публикации в наших социальных сетях.</p>
        <p>Вы соглашаетесь с тем, что мы имеем право раскрывать вашу персональную информацию, но лишь с целью и в случаях, если такое требование выдвинуто государственными органами, в предусмотренном действующим законодательством порядке.</p>

        <p>Мы получаем информацию от игрока для того, чтобы игрок мог:</p>

        <ul>
          <li>пользоваться нашими услугами, в частности, играть в игры и делать ставки;</li>
          <li>подписаться на еженедельную информационную рассылку;</li>
          <li>создавать, управлять, закрывать аккаунт.</li>
        </ul>

        <p>В настройках профиля на нашем сайте игрок может:</p>

        <ul>
          <li>изменить никнейм для отображения на сайте;</li>
          <li>изменить параметры интерфейса.</li>
        </ul>

        <p>Мы получаем информацию от игрока для того, чтобы мы могли:</p>

        <ul>
          <li>идентифицировать Вас в качестве игрока для безопасности и соблюдения наших юридических обязательств;</li>
          <li>поддерживать учетную запись игрока;</li>
          <li>проверять достоверность информации, предоставленную игроком;</li>
          <li>получать вопросы и комментарии от игрока, чтобы реагировать на них и улучшать наши сервисы;</li>
          <li>периодически направлять письменные сообщения о важных изменениях в сервисе, вопросах технического обновления и т.д.;</li>
          <li>изучать подозрение на незаконную, мошенническую деятельность, связанную с нашими услугами;</li>
          <li>сообщать в контролирующие органы о совершении преступлений или подозрения преступлений, включая отмывание денег или мошенничество;</li>
          <li>повышать безопасность и надежность наших сервисов;</li>
          <li>выполнять другие задачи, которые необходимы для выполнения договорных обязательств перед игроком.</li>
        </ul>

        <h2>Маркетинг</h2>

        <p>Время от времени мы можем использовать Вашу персональную информацию, чтобы сообщать Вам о наших продуктах или услугах, или о рекламных акциях, которые, по нашему мнению, могут быть Вам интересны или полезны. Мы можем сделать это по электронной почте, SMS или телефону. Если Вы больше не хотите получать маркетинговые или рекламные материалы от WINMONEY вообще, или в какой-либо конкретной форме, Вы можете в любое время обратиться к нашей команде поддержки клиентов с Вашим запросом, который мы выполним, как только это будет возможно.</p>

        <h2>Доступ к персональной информации</h2>

        <p>Вы можете получить доступ к персональной информации, собранной WINMONEY, перейдя профиль игрока на веб-сайте или обратившись к нашей команде поддержки клиентов с соответствующим запросом.</p>
        <p>Мы предоставим Вам доступ к вашей персональной информации необходимым образом, если это возможно, и в течение разумного периода времени. Если мы отказываем в доступе по таким причинам, мы сообщим Вам в письменном виде об отказе, причинах и механизмах подачи жалоб, которые доступны для Вас.</p>

        <h2>Управление информацией</h2>

        <p>Мы примем все разумные меры, чтобы обеспечить сохранность собираемой, используемой или раскрываемой персональной информации игрока.</p>
        <p>Доступ к такой информации могут иметь только уполномоченные лица.</p>
        <p>WINMONEY уничтожит персональную информацию, которой мы владеем, после того, как в ее использовании, хранении или раскрытии больше не будет надобности, но не скорее 5 лет после ее использования.</p>

        <h2>Безопасность</h2>

        <p>Вы гарантируете, что применяете все возможные способы для сохранности информации, которую Вы нам передаете.</p>
        <p>Вы несете ответственность за безопасность и доступ к Вашему собственному компьютеру, мобильному устройству или любому другому устройству, используемому для получения доступа к сайту.</p>
        <p>Вы несете полную ответственность за сохранение секретности Вашего имени пользователя, пароля и любой другой информации об аккаунте.</p>
        <p>Мы предпримем все разумные меры для защиты Вашей персональной информации от неправомерного использования, потери и несанкционированного доступа, изменения и раскрытия, в том числе с использованием защищенных паролем систем, баз данных и технологии Secure Socket Layer (SSL).</p>
        <p>Сотрудники, агенты и подрядчики WINMONEY обязаны соблюдать конфиденциальность персональной информации игроков.</p>

        <h2>Изменения в этой политике</h2>

        <p>Мы время от времени меняем эту Политику конфиденциальности, однако не ограничиваем Ваши права, описанные в ней, без вашего четкого согласия. Мы всегда указываем дату публикации последних изменений.</p>

        <h2>Обращение с жалобами и применимое законодательство</h2>

        <p>В случае возникновения споров и разногласий наше решение является окончательным и Вы с ним полностью согласны. Все споры и разногласия, возникающие из или в связи с настоящей политикой, разрешаются путем переговоров. Если невозможно достичь соглашения путем переговоров, споры, разногласия и претензии, вытекающие из настоящей политики, разрешаются в соответствии с действующим законодательством Нидерландских Антильских островов.</p>
        <p>Если у Вас есть какие-либо вопросы, запросы на доступ, или жалобы, связанные с обработкой, Вы можете обратиться к нашей команде поддержки клиентов с соответствующим запросом.</p>
      </div>
    </div>
</div>
                        </div>
                        <!-- .card -->
                    </div>
                    </div>
                </div>
            </div>
            <!-- card-body -->            
        </div>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                link: window.location.host
            }
        }
    }
</script>
