<template>
    <div>
        <div class="card">
            <div class="card-header pd-t-20 d-sm-flex align-items-start justify-content-between bd-b-0 pd-b-0">
                <div>
                    <h4 class="mg-b-5 ">Пользовательское соглашение</h4>
                </div>
            </div>
            <div class="card-body pd-20 bd-b pd-b-20">
                <div class="row">
                    <div class="col-12">
                    <div class=" card-crypto">
                        <div class="">
                            <div class="card-innr">
                                <div>
  <div class="rules rules-terms">
    <h1>Пользовательское соглашение</h1>

    <div class="rules-container">
      <p>Настоящие Условия и положения (далее – «Соглашение») регулируют договорные отношения между сторонами, «https://{{ this.link }}» с одной стороны (далее - «Мы» или «Наш») и Вами, как пользователем с другой стороны (далее - «Пользователь», «Вы» или «Ваш»), вместе «Стороны».</p>
      <p>«WINMONEY» - сервис мгновенных многопользовательских и одиночных игр.</p>
      <p>«Пользователь» - лицо, которое соглашается с этими Условиями и положениями.</p>
      <p>Принимая это Соглашение Пользователь тем самым свидетельствует и гарантирует, что он внимательно ознакомился с настоящим Соглашением перед использованием Нашего Веб-сайта https://{{ this.link }} (далее - «Веб-сайт» или «Сайт») и обязуется выполнять и придерживаться всех условий, определенных Сторонами в этом Соглашении.</p>

      <h2>Предмет</h2>

      <p>WINMONEY предоставляет услуги по организации досуга и отдыха в игре «{{ this.link }}» Пользователю в соответствии с условиями и положениями данного Соглашения. Под такими услугами, в частности, подразумеваются следующие:</p>
      <ul>
        <li>услуги по покупке-продаже игрового инвентаря ({{ this.link }});</li>
        <li>ведение учета значимой информации;</li>
        <li>движения по игровому счету;</li>
        <li>обеспечение мер по идентификации и безопасности Пользователей;</li>
        <li>разработка программного обеспечения, интегрируемого в игровую площадку и внешние приложения;</li>
        <li>информационные и другие услуги, необходимые для организации игры и обслуживания Пользователя на Веб-сайте.</li>
      </ul>

      <h2>Общие требования к пользователю и возрастные ограничения</h2>

      <p>Вы можете играть на Нашем Сайте, если Вы из страны, где азартные игры онлайн разрешены. Принимая это Соглашение Пользователь подтверждает и гарантирует, что в государстве, в котором он будет использовать Наши услуги, азартные игры онлайн разрешены. За несоблюдение и нарушения этого требования Пользователь несет ответственность самостоятельно и в полном объеме.</p>
      <p>Вы можете играть, если Вам больше 18 лет. В некоторых государствах, где возрастной ценз выше 18 лет, Вы должны достигнуть совершеннолетия в соответствии законодательства страны Вашего гражданства, для использования наших услуг.</p>
      <p>Для использования Наших услуг Пользователю необходимо подтвердить свой возраст. Мы не несем ответственности за недобросовестные сведения о своем возрасте, предоставленных Пользователем. В случае, если Вы отказываетесь предоставить Нам подтверждение своего возраста или Вам меньше 18 лет, Мы можем заблокировать Ваш аккаунт.</p>
      <p>Мы предпримем все разумные меры, чтобы ограничить доступ к нашему сервису для несовершеннолетних Пользователей. В случае, если Вы, будучи совершеннолетними, используете один и тот же компьютер с несовершеннолетними, Вам следует предотвращать доступ этим лицам, а именно следующую информацию: имена пользователей, пароли, банковские реквизиты. Мы не несем ответственности, в случае нарушения Пользователем вышеуказанных положений.</p>
      <p>Чтобы обеспечить безопасность Ваших детей, Мы рекомендуем Вам установить специальное программное обеспечение, чтобы блокировать доступ несовершеннолетних пользователей к веб-сайтам и программам.</p>
      <p>Есть несколько приложений родительского контроля, которые Вы можете использовать для этой цели:</p>

      <ul>
        <li><a href="https://www.netnanny.com" target="_blank" rel="nofollow">www.netnanny.com</a> - это программное обеспечение используется для защиты детей от нежелательного веб-контента.</li>
        <li><a href="https://www.cybersitter.com" target="_blank" rel="nofollow">www.cybersitter.com</a> - это программное обеспечение позволяет родителям добавлять специальные сайты, которые необходимо заблокировать.</li>
      </ul>

      <p>У нас есть право запросить подтверждение возраста у любого Пользователя и приостановить действие его учетной записи, пока Мы не убедимся, что Пользователю исполнилось 18 лет. Поскольку проверка наличия несовершеннолетних детей занимает много времени, Мы рекомендуем родителям / опекунам сотрудничать с Нами в этом вопросе.</p>
      <p>Если лицо, играющее на веб-сайте WINMONEY, признано несовершеннолетним, все сделанные ставки становятся недействительными, а выигрыши аннулируются. Мы также можем применять другие юридические санкции для такого лица.</p>
      <p>Если Вы обеспокоены тем, что кто-то из несовершеннолетних пользуется Нашим Сайтом, немедленно свяжитесь с Нашей службой поддержки клиентов.</p>

      <h2>Права и обязанности сторон</h2>

      <p>Вы несете персональную ответственность за ведение своих финансовых сделок и операций. WINMONEY не несет ответственности за совершаемые финансовые действия между Пользователями по передаче игрового инвентаря и игровой валюты, а также других игровых атрибутов.</p>
      <p>Вы несете персональную ответственность за все действия, совершенные с игровым инвентарём ({{ this.link }}): покупка, продажа, пополнение и вывод средств, а также за игровые действия на Сайте: создание, покупка-продажа, операции со всеми игровыми элементами и другие игры, атрибуты и объекты, используемые для игрового процесса.</p>
      <p>Вы не имеете права ограничивать доступ тёртым лицам к играм на Сайте, Вы должны уважительно относиться к Пользователям игры, а также к WINMONEY, нашим партнерам и сотрудникам.</p>
      <p>Мы гарантируем, без взимания платы, доступ Пользователя к Веб-сайту и участие в игре. Пользователь самостоятельно оплачивает доступ к интернету за свой счет и несет другие расходы, связанные с этим действием.</p>
      <p>Мы ведем учет игрового инвентаря ({{ this.link }}) в игровой учетной записи Пользователя.</p>
      <p>Мы предоставляем пользователю дополнительные платные услуги, перечень которых, а также порядок и условия их использования, определяются настоящими Условиями и положениями, правилами игровой площадки и другими объявлениями WINMONEY. В то же время, мы имеем право в любой момент изменить количество и объем предлагаемых платных услуг, их стоимость, название, вид и эффект от использования.</p>
      <p>Мы не несем ответственности за неправильное функционирование игрового программного обеспечения. Мы используем программное обеспечение по принципу «КАК ЕСТЬ». Если мы определим, что во время игры на платформе произошла неисправность (ошибка), результаты, которые произошли во время неправильной работы программного обеспечения, могут быть отменены или скорректированы по Нашему усмотрению. Пользователь обязуется не обращаться к WINMONEY о качестве, количестве, порядке и сроках предоставляемых ему игровых возможностей и услуг.</p>

      <h2>Ограничения</h2>

      <p>Странами с ограничениями являются: Соединенные Штаты Америки, Великобритания, Испания, Франция и ее заморские территории (Гваделупа, Мартиника, Французская Гвиана, Реюньон, Майотта, Сен-Мартен, Французская Полинезия, Уоллис и Футуна, Новая Каледония), Нидерланды, Израиль, Голландская Вест-Индия и Кюрасао.</p>
      <p>Мы не можем гарантировать успешную обработку снятия или возврата средств, если Вы нарушаете эту политику запрещенных стран.</p>

      <h2>Психологическое состояние</h2>

      <p>Если Вам в любой момент поставили диагноз компульсивного расстройства, вызванного азартными играми, или Вы чувствуете, что у Вас могут возникнуть проблемы, немедленно покиньте Наш Веб-сайт. Мы рекомендуем Вам обратиться за профессиональной помощью, а также избегать подобных игровых сайтов.</p>

      <h2>Риск потери</h2>

      <p>WINMONEY - это сервис мгновенных многопользовательских и одиночных игр, на котором Пользователь, помимо обеспечения развлечения и игры, может выиграть или потерять деньги, где результат игры не зависит исключительно или в основном (в большинстве случаев) от знаний или навыков Пользователя, но на случай или неопределенное событие. Мы не несем ответственности за какие-либо претензии в отношении убытков или трат любого рода в результате игры на реальные деньги на Нашем Веб-сайте.</p>
      <p>Играть на Сайте можно исключительно на Ваше усмотрение и риск. Вы несете ответственность за сохранение секретности и безопасности паролей Вашей учетной записи и другой личной информации безопасности.</p>

      <h2>Открытие и обслуживание счета (аккаунта)</h2>

      <p>Если Вы не попали под ограничения, указанные выше, и Вы принимаете правила нашего Веб-сайта, Вы можете приступить к открытию учетной записи.</p>
      <p>Вы должны зарегистрировать аккаунт на нашем Сайте лично, следуя пошаговым инструкциям, предоставленным Сайтом.</p>
      <p>Регистрируя учетную запись или по запросу Веб-сайта, Вы соглашаетесь: предоставлять правдивую, точную, актуальную и полную информацию о себе. В случае внесения изменений Вы соглашаетесь обновить эту информацию.</p>
      <p>Вы несете полную ответственность за любое несанкционированное использование Вашей учетной записи третьими лицами в случае утраты пароля и иных сведений для входа в аккаунт, разглашения Вами этой информации, ненадлежащего хранения такой информации, случайной утечки вышеуказанных сведений, взлома Вашего аккаунта, а также в иных случаях. Мы советуем Вам принять все возможные меры для сохранения конфиденциальности Вашего псевдонима / имени пользователя / логина и / или пароля. Если Вы заметили несанкционированное использование Вашей учетной записи, пожалуйста, сообщите Нам об этом немедленно.</p>
      <p>Если какое-либо лицо обманным путем получает доступ к учетной записи, Мы немедленно прекращаем его членство и предпринимаем все необходимые и надлежащие действия в соответствии с настоящим Соглашением, и применимыми законами и правилами. Мы не несем ответственности в связи с мошенническим доступом и использованием аккаунта пользователя.</p>
      <p>Если Ваши действия рассматриваются как преднамеренное мошенничество, Мы можем конфисковать все средства на Вашем счете и принудительно заблокировать аккаунт.</p>
      <p>Вам разрешено иметь только одну учетную запись. Любые дубликаты аккаунтов запрещены, и Вы должны немедленно сообщить Нам, если Вы зарегистрировали дубликат аккаунта. Все транзакции, совершенные с любого дублирующего аккаунта, будут считаться недействительными. Все призы и выигрыши с дубликатов аккаунтов будут аннулированы, а все Ваши аккаунты будут принудительно закрыты.</p>
      <p>Если Вы хотите открыть новую учетную запись, Вы должны связаться с Нашей командой поддержки клиентов. После открытия нового счета, под нашим контролем, старый будет закрыт, внесенные Вами средства и выигрыши будут надлежащим образом переведены.</p>
      <p>В случае, если Вам станет известно о любых возможных ошибках в программном обеспечении Сайта, Вы обязуетесь не использовать их в своих интересах. Кроме того, Вы обязаны немедленно сообщать в службу поддержки клиентов о любой ошибке или неполной информации. Если Вы не выполните вышеуказанные обязательства, Мы имеем право на полное возмещение Вами всех расходов и убытков, связанных с ошибкой и ее использованием Вами, путем конфискации средств на Вашем счете, а также закрытия Вашего аккаунта.</p>
      <p>Если во время регистрации и обслуживания Вашей учетной записи возникнут какие-либо ошибки, пожалуйста, немедленно сообщите Нам.</p>

      <h2>Проверка и закрытие вашего счета</h2>

      <p>В целях проверки Мы можем связаться с Вами любыми средствами связи. Если Мы не сможем связаться с Вами, даже несмотря на то, что Мы неоднократно пытались позвонить вам по номеру, который Вы предоставили Нам через учетную запись Пользователя, Мы можем закрыть Ваш счет и удержать Ваш выигрыш. Если номер телефона, который Вы нам сообщили, не работает или не является реальным номером телефона, Мы имеем право заблокировать Ваш аккаунт и сохранить Ваш выигрыш. Если Мы не сможем связаться с Вами в течение двух недель после начала процесса проверки, Мы можем заблокировать Ваш аккаунт и удержать Ваш выигрыш. Наше вышеуказанное право предоставляется нам с целью борьбы с мошенничеством на нашем Сайте.</p>
      <p>Чтобы закрыть свой аккаунт, обратитесь в службу поддержки клиентов. Мы можем закрыть Ваш счет и вернуть деньги на Ваш счет за вычетом банковских сборов.</p>
      <p>Закрывая свой аккаунт, Вы соглашаетесь с потерей всех рекламных призов и бонусов, которые Вы могли получить при использовании Сайта. После открытия новой учетной записи все рекламные призы и бонусы не будут зачислены на эту учетную запись.</p>
      <p>Если Ваша учетная запись была принудительно закрыта сайтом из-за мошеннических действий или несоблюдения указанных выше разделов, Вам запрещено открывать новую учетную запись на веб-сайте. Вы несете ответственность за регистрацию новой учетной записи в таком случае. Мы оставляем за собой право закрыть новый счет и лишить Вас всех средств, внесенных на него.</p>

      <h2>Депозит, перевод, вывод со счета</h2>

      <p>Максимальная и минимальная ставки, а также максимальная прибыль будут указаны на странице <a href="https://vk.com/im?media=&sel=-209880806&v=" target="_blank">https://vk.com/im?media=&sel=-209880806&v=</a>.</p>
      <p>Вы можете переводить средства в любой доступной валюте. На Ваш счет на Веб-сайте будет зачислена конвертированная во внутреннюю валюту сумма согласно актуальному курсу валют.</p>
      <p>Как правило, мы не принимаем денежные депозиты и депозиты / снятия со счетов третьих лиц.</p>
      <p>Все способы оплаты будут доступны на Веб-сайте, они могут отличаться в зависимости от страны, а также могут время от времени изменяться Веб-сайтом.</p>
      <p>Вы несете ответственность за оплату сборов, которые могут взимать платежные системы. Средства, внесенные на счет на Веб-сайте, должны быть очищены от всех таких сборов.</p>
      <p>Вам необходимо положить деньги на счет, который принадлежит Вам, мы можем потребовать подтверждение источника средств. Личные данные указаны на дебетовой / кредитной карте. Электронный кошелек / банковский перевод (например, полное имя) должен совпадать с личными данными учетной записи Пользователя на Веб-сайте, на который переводятся средства.</p>
      <p>Если используется кредитная / дебетовая карта, Мы просим Вас предоставить изображения лицевой и обратной стороны Вашей карты с указанием названия и номера карты, датой выдачи и с кодом CVV.</p>
      <p>Веб-сайт, как и когда он сочтет это необходимым, может изменять пределы пополнения / снятия средств.</p>
      <p>Веб-сайт не является банком или другим учреждением, поэтому на Ваш депозит проценты не начисляются.</p>
      <p>Веб-сайт переведёт средства в течение 24 часов после успешного завершения идентификации, как указано выше, или в соответствии с выбранными Вами условиями обработчика платежей. Для некоторых платежных систем перевод может занять до 3 рабочих дней.</p>
      <p>Минимальная сумма для снятия составляет 150,00 RUB. Лимит снятия средств в неделю отсутствуют. Сайт оставляет за собой право при выводе разделить сумму на меньшие суммы. Снятие средств возможно только при наличии как минимум одного депозита и не менее 10 успешно проведённых игр.</p>
      <p>Максимальная общая сумма снятия одним пользователем за 1 календарный месяц не может превышать 1 000 000,00 RUB. Если ожидается снятие большей суммы, она будет разбита на равные части по 1 000 000,00 RUB (либо меньше) и выведена в течение нескольких календарных месяцев, кол-во которых зависит от общей суммы для снятия.</p>
      <p>Рассмотрение операций по снятию средств при больших выигрышах (более 500 000,00 RUB) могут занимать до 30 календарных дней.</p>
      <p>Сайт может взимать комиссию за обработку ввода / вывода. Комиссия будет зависеть от суммы перевода и способа перевода.</p>
      <p>Если вы хотите осуществить возврат пополненных средств, обратитесь в нашу команду поддержки. Вам будет необходимо предоставить Ваш идентификатор профиля на сайте. Обратите внимание, что возврат будет возможен только при условии, что Вы не начали игру после внесения средств и в течении 48 часов после внесения средств.</p>
      <p>Средства будут возвращены на тот-же счет, с которого они были внесены, с вычетом банковской комиссии. Наша команда поддержки может потребовать у Вас дополнительные документы для идентификации Вашей личности при рассмотрении заявки на возврат. Возврат средств будет осуществлен в течении 24 часов с момента принятия заявки на возврат командой поддержки.</p>
      <p>Прочтите дополнительную информацию на данной странице <a href="https://vk.com/im?media=&sel=-209880806&v=" target="_blank">https://vk.com/im?media=&sel=-209880806&v=</a>.</p>

      <h2>Возврат платежей</h2>

      <p>Возвратные платежи вступают в силу только после предварительного согласия администрации Сайта.</p>
      <p>Если возврат был произведен без Нашего предварительного согласия, Вы соглашаетесь защищать Веб-сайт от любых потерь, претензий и возмещаете любые связанные с этим расходы, включая стоимость восстановления таких средств.</p>
      <p>Вы должны знать, что снятие средств с помощью банковских переводов может, в исключительных случаях, облагаться дополнительными комиссиями банков-посредников.</p>

      <h2>Мошеничество</h2>

      <p>Мы не допускаем мошенничества. Мошенничеством будут считаться следующие случаи:</p>

      <ul>
        <li>работа с другими пользователями для получения прибыли;</li>
        <li>использование способов получения выигрыша путем обмана;</li>
        <li>использование скриптов, ботов, кликеров и любых других программных средств, позволяющих проводить игры в обход предусмотренного для этого интерфейса Веб-сайта;</li>
        <li>регистрация более одного аккаунта;</li>
        <li>мошенничество с другими онлайн-казино или платежными системами;</li>
        <li>возврат средств с кредитной карты;</li>
        <li>другие виды мошенничества;</li>
        <li>предоставление Нам ложной информации.</li>
      </ul>

      <p>О любых программных ошибках, обнаруженных Пользователем, следует сообщать на Веб-сайте в службу поддержки клиентов. Категорически запрещается злоупотреблять ошибками в Ваших интересах в играх или в ущерб другим Пользователям. Такое злоупотребление будет квалифицировано как мошенничество.</p>
      <p>Сайт оставляет за собой право приостановить или удалить любую игру, в которой ошибка приводила к несправедливым результатам, некорректному поведению пользователей или процессу в целом.</p>

      <h2>Запреты и ограничения</h2>

      <p>Запрещается использовать Веб-сайт в целях распространение клеветы, нанесения оскорблений, расизма, сексизма, гомофобии или дискриминации по отношению к любым Пользователям, третьим лицам разных религиозных убеждении, расы, цвета кожи, сексуальной ориентации и так далее. Запрещено использовать нецензурную лексику на любом языке как словесно так и на изображениях, а также угрозы, преследования или оскорбления в отношении любого другого лица / Пользователя.</p>
      <p>Запрещено продавать, передавать и / или приобретать аккаунты у других Пользователей.</p>
      <p>Категорически запрещается использовать сервис для создания многочисленных приложений, чтобы воспользоваться разницей в курсах обмена. Если пользователь организует обменный пункт, его / ее депозит будет возвращен обратно с вычетом комиссии за перевод.</p>
      <p>Запрещено получать льготы для пользователей / не пользователей заговора. В случае их обнаружения все пользователи сталкиваются с баном и обнулением, WINMONEY может установить дополнительное наказание.</p>
      <p>Запрещается использовать любые внешние программы для получения преимуществ в играх.</p>
      <p>В случае нарушения положения, изложенного в этом разделе, Веб-сайт будет проводить расследование, а также сообщать о любом таком нарушении соответствующим правоохранительным органам, и таким образом, будет сотрудничать с этими органами, раскрывая им Вашу личность, а также будет проводить принудительное расследование, закрытие аккаунта игроков.</p>
      <p>Мы имеем право расторгнуть настоящее Соглашение в одностороннем порядке, а также совершать другие действия, ограничивающие возможности в игре, в отношении Пользователя или группы Пользователей, которые являются соучастниками нарушений условий настоящего Соглашения. В то же время, все игровые атрибуты, игровое оборудование ({{ this.link }}), находящиеся в учетной записи и в игровой учетной записи Пользователя или группы Пользователей, а также все расходы не подлежат возврату и не возмещаются, за исключением случаев, когда они переиграны, по своему усмотрению считает целесообразным компенсировать расходы Пользователя или группы Пользователей.</p>

      <h2>Изменения в соглашении</h2>

      <p>Мы можем изменить Соглашение в одностороннем порядке. В таких случаях согласие Пользователя не требуется. Мы запросим Ваше согласие для внесения этих изменений, если такое требование содержит действующее законодательство.</p>
      <p>Новая версия Соглашения вступит в силу сразу после Вашего следующего посещения или входа на Веб-сайт. Вы будете уведомлены о любых изменениях в Соглашении, путем указания об изменениях в верхней части текущей страницы.</p>
      <p>Продолжая использовать Наш Веб-сайт, Вы принимаете последние изменения в Соглашении. Если Вы не согласны с условиями и положениями настоящего Соглашения, Вы не должны использовать Наш Веб-сайт или получать к нему доступ, а также немедленно сообщить Нам об этом в письменном виде.</p>

      <h2>Гарантии</h2>

      <p>Мы отказываемся от любой ответственности за убытки Пользователя, связанные с неправильным пониманием принципов и правил работы Нашего Сайта.</p>
      <p>Мы не гарантируем постоянный и непрерывный доступ к игровой площадке и его услугам в случае возникновения технических неполадок и/или непредвиденных обстоятельств, в числе которых: неполноценная работа или не функционирование интернет-провайдеров, серверов информации, банковских и платёжных систем, а также неправомерных действий третьих лиц.</p>
      <p>Сайт не несет ответственности за нарушения, которые могут возникнуть в результате каких-либо действий любых Пользователей с любой целью, которая нарушает какой-либо закон.</p>
      <p>Мы не несем налогового бремени за Пользователя. Пользователь обязуется самостоятельно включать возможные полученные доходы в налоговую декларацию в соответствии с законодательством страны своей резиденции.</p>
      <p>Мы не несем никакой ответственности за невыполнение или задержку в выполнении любого из наших обязательств в соответствии с настоящим Соглашением, вызванными событиями, которые не находятся под нашим разумным контролем, включая, помимо прочего, стихийные бедствия, войны, гражданские волнения, прерывание в сетях или службах общедоступных коммуникаций, производственные споры или DDoS-атаки и аналогичные интернет-атаки, которые оказывают неблагоприятное воздействие. Деятельность Веб-сайта считается приостановленным на период форс-мажорных обстоятельств, и у нас будет продление времени для работы в течение этого периода. Мы приложим все усилия, чтобы завершить форс-мажорные обстоятельства или найти решение, с помощью которого Наши обязательства могут быть выполнены, несмотря на это событие.</p>

      <h2>Обращение с жалобами и применимое законодательство</h2>

      <p>В случае возникновения споров и разногласий решение {{ this.link }} является окончательным и Пользователь с ним полностью согласен. Все споры и разногласия, возникающие из или в связи с настоящим Соглашением, разрешаются путем переговоров. Если невозможно достичь соглашения путем переговоров, споры, разногласия и претензии, вытекающие из настоящего Соглашения, разрешаются в соответствии с действующим законодательством Нидерландских Антильских островов. Если у Вас есть какие-либо жалобы относительно активности на Сайте, Вы можете обратиться в нашу службу поддержки клиентов.</p>
    </div>
  </div>
</div>
                            </div>
                            <!-- .card -->
                        </div>
                    </div>
                    </div>
                </div>
                <!-- card-body -->
            </div>
        </div>
        </div>
</template>

<style>
.ter-n {
    font-weight: 600;
}                              
</style>

<script>
    export default {
        data() {
            return {
                link: window.location.host
            }
        }
    }
</script>
